Repository: 84000/data-translation-memory
Catalog: Toh_152-The_Questions_of_Sagaramati-v2.tmx
Source language: bo
Languages: en

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ཉོན་མོངས་པ་མེད་པར་གནས་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྐྱོབ་པའོ། །
en: There are two teachings that are challenging: maintaining an absence of afflictions and protecting all beings.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། འདོད་པ་ཆུང་བ་དང་། ཆོག་ཤེས་པའོ། །
en: “There are two teachings that are held in high regard: having few desires and being content.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། རང་གི་ཉོན་མོངས་པ་ཚོལ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་སྤོང་བ་ཚོལ་བའོ། །
en: There are two teachings that are challenging: seeking out one’s afflictions and seeking the elimination of all beings’ afflictions.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ངེས་པར་སེམས་པ་དང་། སོ་སོར་རྟོག་པའོ། །
en: “There are two teachings that are held in high regard: certainty and understanding.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། རང་གི་འཁྲུལ་པ་ལ་རྟོག་པ་དང་། གཞན་གྱི་འཁྲུལ་བ་ལ་སྐྱོན་དུ་མི་ལྟ་བའོ། །
en: There are two teachings that are challenging: recognizing one’s own confusion and not seeing others’ confusion as a fault.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། བདག་ལ་མི་སྟོད་པ་དང་། གཞན་ལ་མི་སྨོད་པའོ། །
en: “There are two teachings that are held in high regard: not praising oneself or condemning others.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། བདག་ལ་བདག་མེད་པ་དང་། སེམས་ཅན་ལ་སེམས་ཅན་མེད་པའོ། །
en: There are two teachings that are challenging: seeing the lack of self in oneself and the lack of beings in beings.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ།
en: “There are two teachings that are held in high regard:

source: རང་གི་བྱེད་པ་དང་། གཞན་གྱིས་སྐབས་མི་རྙེད་པའོ། །
en: Acting on one’s own and not relying on others.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། འཁོར་བ་ལས་ལྡོག་པ་དང་། འཁོར་བ་ནས་སེམས་ཅན་ཡོངས་སུ་ཐར་བར་བྱེད་པའོ། །
en: There are two teachings that are challenging: reversing saṃsāra and freeing beings from saṃsāra.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་ཚོལ་བ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་བཙལ་བ་རྣམས་ལ་ཇི་སྐད་བསྟན་པ་བཞིན་དུ་གནས་པའོ། །
en: “There are two teachings that are held in high regard: pursuing the perfections, and living according to what one teaches to those who are pursuing the perfections.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། གཞན་ལ་རག་མ་ལས་པའི་ཤེས་པ་རབ་ཏུ་ཐོབ་པ་དང་། གཞན་དག་ཀྱང་ཤེས་པ་ལ་རབ་ཏུ་སྦྱོར་བའོ། །
en: There are two teachings that are challenging: attaining insight that does not depend on anyone else and bringing others to knowledge.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། འཐོབ་པ་དང་བཀུར་སྟི་དང་ཚིགས་སུ་བཅད་པ་དོན་དུ་མི་གཉེར་བ་དང་། དམ་པའི་ཆོས་ཡོངས་སུ་བཙལ་བ་དོན་དུ་གཉེར་བའོ། །
en: “There are two teachings that are held in high regard: being disinterested in gain, honor, and praise, and being interested in pursuing the Dharma.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ཕན་མ་བཏགས་པ་རྣམས་ལ་ཡང་ཕན་འདོགས་པ་དང་། ཕན་བཏགས་པ་རྣམས་ལ་ཡང་ལྷག་པར་དགའ་བ་མེད་པའོ། །
en: There are two teachings that are challenging: benefiting those who do not benefit oneself, and not overly liking those who do.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། བྱམས་པ་ཆེན་པོ་ཐུག་པ་མེད་པར་བྱས་པ་དང་། སྙིང་རྗེ་ཆེན་པོ་ཡོངས་སུ་ཆད་པ་མེད་པའོ། །
en: “There are two teachings that are held in high regard: practicing great love that knows no limit and practicing uninterrupted great compassion.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། རྒལ་ནས་འཇུག་པ་དང་། མ་རྒལ་བ་རྣམས་སྒྲོལ་བའོ། །
en: There are two teachings that are challenging: engaging with saṃsāra once one has crossed over, and liberating those who have not crossed over.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། སེམས་ཅན་ཐམས་ཅད་ཡོན་ཏན་ཡང་དག་པར་འཛིན་དུ་འཇུག་པ་དང་། ཡོན་ཏན་མེད་པའི་སེམས་ཅན་རྣམས་ལ་ཆེར་སྙིང་རྗེ་བའོ། །
en: “There are two teachings that are held in high regard: encouraging all beings to develop qualities and being especially compassionate to beings who have no qualities.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། སླར་མི་བྱེད་པ་རྣམས་ལ་ཡང་ཕྱིར་བྱེད་པ་དང་། ཕྱིར་བྱེད་པ་རྣམས་ལ་ཡང་རློམ་སེམས་མེད་པའོ། །
en: There are two teachings that are challenging: helping those who do not reciprocate favors, and being free from concepts about those who do reciprocate.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ལུས་ལ་ཞུགས་པའི་དྲན་པ་ལ་གནས་པ་དང་། ལུས་ཡོངས་སུ་དག་པ་ལ་གནས་པའོ། །
en: “There are two teachings that are held in high regard: maintaining mindfulness applied to the body, and maintaining the purity of the body.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་བལྟ་བ་དང་། ལུས་དང་ལྷན་ཅིག་སོང་བའི་རྣམ་པར་རྟོག་པས་རྣམ་པར་མི་རྟོག་པའོ། །
en: There are two teachings that are challenging: applying a view of the body onto the body, and not conceptualizing thoughts that come along with a body.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ཚོར་བ་ལ་ཞུགས་པའི་དྲན་པ་ལ་གནས་པ་དང་། བདེ་བ་དང་སྡུག་བསྔལ་གྱི་ཚོར་བ་གཉིས་ཀྱིས་མི་ཕིགས་པའོ། །
en: “There are two teachings that are held in high regard: maintaining mindfulness applied to feelings, and not being pierced by the feelings of pleasure or pain.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ཚོར་བ་རྣམས་ལ་ཚོར་བའི་རྗེས་སུ་བལྟ་བ་དང་། ཚོར་བ་དང་ལྷན་ཅིག་སོང་བའི་རྣམ་པར་རྟོག་པས་རྣམ་པར་མི་རྟོག་པའོ། །
en: There are two teachings that are challenging: applying a view of feelings onto feelings, and not thinking in terms of thoughts that go along with feelings.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། སེམས་ལ་ཞུགས་པའི་དྲན་པ་ལ་གནས་པ་དང་། སེམས་ཡོངས་སུ་དག་པ་ལ་གནས་པའོ། །
en: “There are two teachings that are held in high regard: maintaining mindfulness applied to mind, and maintaining the purity of mind.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། སེམས་ལ་སེམས་ཀྱི་རྗེས་སུ་བལྟ་བ་དང་། སེམས་དང་ལྷན་ཅིག་སོང་བའི་རྣམ་པར་རྟོག་པས་རྣམ་པར་མི་རྟོག་པའོ། །
en: There are two teachings that are challenging: applying a view of mind onto mind, and not thinking in terms of thoughts that go along with mind.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ཆོས་ལ་ཞུགས་པའི་དྲན་པ་ལ་གནས་པ་དང་། ཆོས་རབ་ཏུ་རྣམ་པར་འབྱེད་པ་ཤེས་པའོ། །
en: “There are two teachings that are held in high regard: maintaining mindfulness applied to phenomena, and distinguishing phenomena.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ཆོས་རྣམས་ལ་ཆོས་ཀྱི་རྗེས་སུ་བལྟ་བ་དང་། ཆོས་དང་ལྷན་ཅིག་སོང་བའི་རྣམ་པར་རྟོག་པས་རྣམ་པར་མི་རྟོག་པའོ། །
en: There are two teachings that are challenging: applying a view of mental phenomena onto phenomena, and not thinking in terms of thoughts that go along with phenomena.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། སྡིག་པ་མི་དགེ་བའི་ཆོས་སྐྱེས་པ་རྣམས་སྤོང་བ་དང་། དགེ་བའི་ཆོས་མ་སྐྱེས་པ་རྣམས་སྐྱེད་པའོ། །
en: “There are two teachings that are held in high regard: abandoning those nonvirtuous negative qualities that have arisen, and producing virtuous qualities that have not yet arisen.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། སྡིག་པ་མི་དགེ་བའི་ཆོས་མ་སྐྱེས་པ་རྣམས་མི་སྐྱེད་པ་དང་། དགེ་བའི་ཆོས་སྐྱེས་པ་རྣམས་ཀུན་ཏུ་སྲུང་བའོ། །
en: There are two teachings that are challenging: preventing nonvirtuous negative qualities that have not already developed, and protecting those virtuous qualities that have developed.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། འདུན་པ་དང་། བརྩོན་འགྲུས་དང་། སེམས་དང་། དཔྱོད་པའི་རྫུ་འཕྲུལ་གྱི་རྐང་པ་བསྒོམས་པ་དང་། རྫུ་འཕྲུལ་གྱི་འདུལ་བའི་སེམས་ཅན་རྣམས་འདུལ་བའོ། །
en: “There are two teachings that are held in high regard: cultivating the bases of miracles—interest, diligence, conscientiousness, and investigation—and guiding beings who can be guided by miraculous powers.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། མངོན་པར་འདུ་བྱེད་པ་མེད་པའི་རྫུ་འཕྲུལ་རབ་ཏུ་ཐོབ་པ་དང་། ཆོས་ཀྱི་དབྱིངས་ལས་མ་གཡོས་པར་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་དུ་འགྲོ་བའོ། །
en: There are two teachings that are challenging: attaining unconditioned miraculous powers, and traveling to all buddha realms without wavering from the realm of phenomena.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། བདག་ཉིད་དད་པ་ལས་མི་གཡོ་བ་དང་། མ་དད་པ་རྣམས་ཀྱང་དད་པ་ལ་སྦྱོར་བའོ། །
en: “There are two teachings that are held in high regard: not wavering from one’s faith, and bringing faith to the faithless.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། སེམས་གསལ་བ་དང་། སེམས་མི་གསལ་བ་རྣམས་དང་བར་བྱེད་པའོ། །
en: There are two teachings that are challenging: bringing appreciation to those whose minds are lucid and to those whose minds are not.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། བརྩོན་འགྲུས་ཀྱི་དབང་པོ་སྐྱེད་པ་དང་། དྲན་པའི་དབང་པོ་མི་གཡེང་བའོ། །
en: “There are two teachings that are held in high regard: developing the faculty of diligence and not being distracted from the faculty of mindfulness.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བས་རྣམ་པར་འབྱེད་པའི་བརྩོན་འགྲུས་དང་། སྟོང་པ་ཉིད་ཀྱི་རྣམ་པར་མངོན་པར་བསྒྲུབས་པའི་དྲན་པའོ། །
en: There are two teachings that are challenging: discerning powerful diligence, and mindfulness that accomplishes emptiness.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་ཀྱི་དབང་པོའི་ཚོགས་ཡོངས་སུ་ཚོལ་བ་དང་། ཚོགས་ཡོངས་སུ་ཚོལ་བས་ཡོངས་སུ་མི་སྐྱོ་བའོ། །
en: “There are two teachings that are held in high regard: pursuing the accumulation of the faculties of absorption and insight, and never being discouraged in the pursuit of the accumulations.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། རྒྱུ་བ་མེད་པ་ཤེས་པ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པའི་ཕྱིར་ཡང་རྒྱུ་བའོ། །
en: There are two teachings that are challenging: knowing how to be unmoving, and moving when necessary for the sake of ripening beings.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ཉོན་མོངས་པ་ཐམས་ཅད་ལ་ཚུལ་བཞིན་གྱིས་སོ་སོར་རྟོག་པ་དང་། ཉོན་མོངས་པ་སྐྱེས་པ་དང་མ་སྐྱེས་པ་རྣམས་ལས་འབྱུང་བ་ཡོངས་སུ་ཚོལ་བའོ། །
en: “There are two teachings that are held in high regard: correctly understanding all the afflictions, and seeking what comes from both the occurrence and non-occurrence of afflictions.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ཉོན་མོངས་པ་མེད་པས་ཆོས་ཐམས་ཅད་མི་འདྲེ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་སྤོང་བའི་ཕྱིར་ཁམས་གསུམ་དུའང་འདྲེ་བའོ། །
en: There are two teachings that are challenging: not mixing with any phenomenon due to the absence of afflictions, and mixing with the three realms in order to cause the abandonment of beings’ afflictions.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བསྒོམ་པའི་བརྩོན་འགྲུས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བསྟན་པའི་ཕྱིར་ལྷག་པའི་བསམ་པའོ། །
en: “There are two teachings that are held in high regard: diligence that cultivates the branches of awakening and the motivation to teach the branches of awakening.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ཟད་པ་ཤེས་པར་མི་ལྟུང་བ་དང་། མི་སྐྱེ་བ་ཤེས་པ་ལ་བཟོད་པའོ། །
en: There are two teachings that are challenging: not falling into the knowledge of exhaustion and accepting the knowledge of the unborn.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ལམ་བགྲོད་པ་ལ་མཁས་པ་དང་། ལམ་མི་བགྲོད་པ་ལ་མཁས་པའོ། །
en: “There are two teachings that are held in high regard: skillfully traversing the path and skillfully not traversing the path.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ལམ་གྱིས་འགྲོ་བ་ཤེས་པ་དང་། ལམ་རྒྱུན་མི་འཆད་པར་ཤེས་པའོ། །
en: There are two teachings that are challenging: understanding how to progress through the path and understanding that the path is uninterrupted.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་རྗེས་སུ་འཐུན་པ་དང་། མཐར་བལྟ་བ་གཉིས་ཀ་ཡོངས་སུ་སྤོང་བའོ། །
en: “There are two teachings that are held in high regard: being in accord with dependent origination and discarding the two extreme views.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། རྒྱུ་གང་དང་རྐྱེན་གང་གིས་སེམས་ཅན་རྣམས་ཀུན་ནས་ཉོན་མོངས་པར་འགྱུར་བ་དང་། རྒྱུ་གང་དང་རྐྱེན་གང་གིས་རྣམ་པར་དག་པར་འགྱུར་བ་དེ་ཤེས་པའོ། །
en: There are two teachings that are challenging: understanding what causes and conditions bring about pollution, and understanding what causes and conditions bring about purification.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། བདུད་ཀྱི་ལས་རྟོགས་པ་དང་། བདུད་ཀྱི་ལས་རྣམ་པར་སྤོང་བའོ། །
en: “There are two teachings that are held in high regard: realizing the acts of māras and discarding the acts of māras.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། བདུད་ཐམས་ཅད་ལས་ཤིན་ཏུ་འདའ་བ་དང་། བདུད་ཐམས་ཅད་མི་མཐོང་བའོ། །
en: There are two teachings that are challenging: transcending all māras and not seeing any māras.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། མ་སྨས་པ་རྣམས་སྨས་པར་མི་བྱེད་པ་དང་། སྨས་པ་རྣམས་ལ་བཟོད་ཅིང་དེས་པའོ། །
en: “There are two teachings that are held in high regard: not upsetting those who are not upset and being patient and gentle with those who are upset.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། གདོད་མ་ནས་སྨས་པ་མེད་པ་དང་། སྐད་ཅིག་ཏུ་འཇིག་པར་སོ་སོར་རྟོག་པའོ། །
en: There are two teachings that are challenging: never getting upset and understanding that anything can be instantly destroyed.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། སེམས་དང་པོ་སྐྱེད་པ་ནས་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་བལྟ་བ་དང་། བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་བལྟས་ནས་ཐེག་པ་དམན་པ་མི་འདོད་པའོ། །
en: “There are two teachings that are held in high regard: keeping the seat of awakening in view once one has initially developed the mind of awakening, and having no desire for the Lesser Vehicle while keeping the seat of awakening in view.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། སེམས་དང་པོ་བསྐྱེད་པ་བྱང་ཆུབ་ཀྱི་སྙིང་པོའི་རྒྱུ་དང་། རྒྱུ་ལས་ཡང་དག་པར་འབྱུང་བའི་དགེ་བའི་སེམས་བསྐྱེད་པ་རྣམས་ལ་མངོན་པར་ཞེན་པ་མེད་པའོ། །
en: There are two teachings that are challenging: being free from clinging to the initial mind of awakening that functions as the cause of the seat of awakening, and being free from clinging to engendering the virtuous mind states that emerge from that cause.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། འཁོར་བའི་རྒྱུན་བྱེད་པའི་ཀུན་ཏུ་སྦྱོར་བ་རྣམས་རྣམ་པར་གཅོད་པ་དང་། དགེ་བའི་རྩ་བའི་རྒྱུན་བྱེད་པའི་སེམས་བསྐྱེད་པ་མི་འདོར་བའོ། །
en: “There are two teachings that are held in high regard: severing the ties that sustain the continuity of saṃsāra, and not losing the mind of awakening that sustains the continuity of roots of virtue.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། ཡུལ་ན་མི་གནས་ཕྱོགས་ན་མི་གནས་པའི་དགེ་བའི་རྩ་བ་རྣམས་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བ་དང་། བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོས་པའི་སེམས་བསྐྱེད་པ་རྣམས་སྒྱུ་མའི་ཆོས་སུ་སོ་སོར་རྟོག་པའོ། །
en: There are two teachings that are challenging: dedicating roots of virtue that rely neither on places or directions to awakening, and knowing the illusory nature of the development of the mind of awakening that is dedicated to awakening.

source: གཅེས་སྤྲས་བྱེད་པའི་ཆོས་གཉིས་ཏེ། བྱང་ཆུབ་སེམས་ཅན་གྱི་ཁ་ན་ལས་པར་ཡང་དག་པར་རྗེས་སུ་མཐོང་བ་དང་། སེམས་ཅན་རབ་ཏུ་ཐར་པ་བྱང་ཆུབ་ཀྱི་ཁ་ན་ལས་པར་ཡང་དག་པར་རྗེས་སུ་མཐོང་བའོ། །
en: “There are two teachings that are held in high regard: seeing awakening as something sentient beings should accomplish, and seeing the liberation of beings as something that awakening should accomplish.

source: དཀའ་བ་བྱེད་པའི་ཆོས་གཉིས་ཏེ། བྱང་ཆུབ་མཉམ་པ་ཉིད་པས་སེམས་ཅན་མཉམ་པ་ཉིད་དུ་སོ་སོར་རྟོག་པ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་བརྩོན་འགྲུས་མི་འདོར་བའོ། །
en: There are two teachings that are challenging: understanding beings as sameness because awakening is sameness, and not giving up one’s diligence such that one may ripen beings.

source: དགེ་བའི་ཆོས་ཐམས་ཅད་བསགས་པའི་སེམས་བསྐྱེད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་མྱ་ངན་ལས་འདས་པའི་ལམ་ལ་རབ་ཏུ་དགོད་པའི་ཕྱིར་ཆེར་སྙིང་རྗེ་བ་སྟེ།
en: Developing the intention to accumulate all virtuous qualities, and arousing compassion to establish all beings on the path to nirvāṇa.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་དེ་གཉིས་ནི་ཐེག་པ་ཆེན་པོ་ལ་གཅེས་སྤྲས་བྱེད་པའོ། །
en: Sāgaramati, these are two teachings that are held in high regard in the Great Vehicle.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་འདི་གཉིས་ནི་ཐེག་པ་ཆེན་པོ་ལ་དཀའ་བ་བྱེད་པ་སྟེ།
en: Sāgaramati, there are two teachings that are challenging in the Great Vehicle.

source: སྐྱེ་བ་མེད་པ་ལས་སྐྱེ་བ་དང་། འབྱུང་བ་མེད་པ་ལས་འབྱུང་བ་སྟེ།
en: Taking birth from the unborn and arising from the unarisen.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་དེ་གཉིས་ནི་ཐེག་པ་ཆེན་པོ་ལ་དཀའ་བ་བྱེད་པའོ། །
en: Sāgaramati, these are two teachings that are challenging in the Great Vehicle.

source: བློ་གྲོས་རྒྱ་མཚོ་གཞན་ཡང་ཐེག་པ་ཆེན་པོ་སྟོན་པར་འགྱུར་བའི་ཆོས་གསུམ་སྟེ།
en: “Sāgaramati, moreover, there are three teachings that reveal the Great Vehicle.

source: འདི་ལྟ་སྟེ། དགེ་བའི་རྩ་བས་བརྟན་ནས་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་པ་དང་། དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་ཟིན་པས་ཞུམ་པ་མེད་པ་དང་། སྙིང་རྗེ་ཆེན་པོ་ལ་རབ་ཏུ་གནས་པས་ཕྱིར་མི་ལྡོག་པ་སྟེ།
en: They are: developing the mind of awakening through stable roots of virtue, being impossible to discourage because of being accepted by a spiritual friend, and being irreversible by maintaining great compassion.

source: བློ་གྲོས་རྒྱ་མཚོ་ཆོས་གསུམ་པོ་དེ་དག་ནི་ཐེག་པ་ཆེན་པོ་སྟོན་པར་འགྱུར་བའོ། །
en: Sāgaramati, these are three teachings that reveal the Great Vehicle.

source: གཞན་ཡང་ཐེག་པ་ཆེན་པོ་སྟོན་པར་འགྱུར་བའི་ཆོས་གསུམ་སྟེ།
en: “Sāgaramati, there are three other teachings that reveal the Great Vehicle.

source: ཚོགས་ཡོངས་སུ་ཚོལ་བ་དང་། ཚོགས་ལ་སོ་སོར་རྟོག་པ་དང་། ཚོགས་ལ་སེམས་ཅན་སྦྱོར་བ་སྟེ། གསུམ་པོ་དེ་དག་གོ། །
en: Seeking the accumulations, realizing the accumulations, and bringing beings to the accumulations.

source: གཞན་ཡང་གསུམ་སྟེ།
en: “There are another three.

source: སེར་སྣ་ཚར་གཅོད་པ་དང་། གཏོང་བ་འཕེལ་བར་བྱེད་པ་དང་། བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བ་སྟེ། གསུམ་པོ་དེ་དག་གོ། །
en: Destroying stinginess, increasing giving, and dedicating this to awakening.

source: གཞན་ཡང་གསུམ་སྟེ། ཚུལ་ཁྲིམས་ཡང་དག་པར་འཛིན་པ་དང་། ཚུལ་ཁྲིམས་འཆལ་བའི་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་དང་། བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བའོ། །
en: “There are another three: authentically upholding discipline, ripening beings with corrupt discipline, and dedicating this to awakening.

source: གཞན་ཡང་གསུམ་སྟེ། ཁོང་ཁྲོ་བ་མེད་པའི་སེམས་དང་། སེམས་ཅན་ཁྲོས་པ་དད་པར་བྱེད་པ་དང་། བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བའོ། །
en: “There are another three: having a mind devoid of anger, causing faith in angry beings, and dedicating this to awakening.

source: གཞན་ཡང་གསུམ་སྟེ། བརྩོན་འགྲུས་མ་གོད་པ་དང་། སེམས་ཅན་ལེ་ལོ་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་དང་། བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བའོ། །
en: “There are another three: not losing one’s diligence, ripening lazy beings, and dedicating this to awakening.

source: གཞན་ཡང་གསུམ་སྟེ། བསམ་གཏན་སྐྱེད་པ་དང་། བསམ་གཏན་དེ་ལ་མ་ཆགས་པ་དང་། བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བའོ། །
en: “There are another three: developing concentration, not being attached to that concentration, and dedicating this to awakening.

source: གཞན་ཡང་གསུམ་སྟེ། ཐོས་པ་ཡོངས་སུ་ཚོལ་བ་དང་། ཐོས་པ་ལ་སོ་སོར་རྟོག་པ་དང་། བྱང་ཆུབ་ཏུ་ཡོངས་སུ་སྔོ་བའོ། །
en: “There are another three: seeking out opportunities to listen, realizing what one has heard, and dedicating this to awakening.

source: གཞན་ཡང་གསུམ་སྟེ། སེམས་ཅན་ལ་དམིགས་པའི་བྱམས་པ་དང་། ཆོས་ལ་དམིགས་པའི་བྱམས་པ་དང་། དམིགས་པ་མེད་པའི་བྱམས་པའོ། །
en: “There are another three: love with reference to beings, love with reference to phenomena, and non-referential love.

source: གཞན་ཡང་གསུམ་སྟེ། རང་གིས་བྱེད་པའི་སྙིང་རྗེ་དང་། གཞན་བྱེད་དུ་འཇུག་པའི་སྙིང་རྗེ་དང་། མཐའ་གཉིས་བསལ་བའི་སྙིང་རྗེ་ཆེན་པོའོ། །
en: “There are another three: compassion developed by oneself, compassion directed towards the actions of others, and great compassion that eradicates the two extremes.

source: གཞན་ཡང་གསུམ་སྟེ། བདག་ལ་ཕན་པའི་ཕྱིར་ཤེས་པ་ཡོངས་སུ་ཚོལ་བ་དང་། གཞན་ལ་ཕན་པའི་ཕྱིར་ཤེས་པ་ཡོངས་སུ་ཚོལ་བ་དང་། གཉི་གའི་དོན་ཡོངས་སུ་རྫོགས་པར་བྱ་བའི་ཕྱིར་བརྩོན་འགྲུས་རྩོམ་པའོ། །
en: “There are another three: seeking knowledge to benefit oneself, seeking knowledge to benefit others, and practicing diligence so that one may perfect the benefit of both.

source: གཞན་ཡང་གསུམ་སྟེ། འདས་པ་ལ་ཟད་པར་ཤེས་པ་དང་། མ་འོངས་པ་ལ་མ་ཕྱིན་པར་ཤེས་པ་དང་། ད་ལྟར་བྱུང་བ་ལ་ཆོས་གནས་པ་མེད་པར་ཤེས་པའོ། །
en: “There are another three: knowledge of the exhaustion of the past, knowledge of the non-arrival of the future, and knowledge of how phenomena do not exist in the present.

source: གཞན་ཡང་གསུམ་སྟེ། ངེས་པའི་སེམས་ཅན་རྣམས་ལ་རབ་ཏུ་གྲོལ་བའི་བྱམས་པ་དང་། མ་ངེས་པའི་སེམས་ཅན་རྣམས་ལ་རབ་ཏུ་གྲོལ་བའི་བྱམས་པ་དང་། ལོག་པ་ཉིད་དུ་ངེས་པའི་སེམས་ཅན་རྣམས་ལ་བསྐྱབ་པ་ཆེན་པོའི་བྱམས་པའོ། །
en: “There are another three: love that liberates beings who have certainty, love that liberates beings who have no certainty, and great love that protects beings who have developed perverse certainty.

source: གཞན་ཡང་གསུམ་སྟེ། འགྲོགས་ན་བདེ་བས་ལུས་ལས་སུ་རུང་བ་དང་། ཕ་རོལ་ཀུན་ཏུ་སྲུང་བས་ངག་སྙན་པ་དང་། དྲང་བས་སེམས་ལས་སུ་རུང་བའོ། །
en: “There are another three: pliancy of body through being pleasant to be with, pleasant speech through protecting others, and pliancy of mind through being honest.

source: མི་སྡུག་པ་ལ་ཡང་གནས་ལ་འདོད་ཆགས་ལ་སྤྱོད་པའི་སེམས་ཅན་དང་འགྲོགས་པ་ལ་ཡང་མི་སྨོད་པ་དང་།
en: not criticizing those who maintain their awareness of unpleasantness while keeping company with beings who indulge in desire;

source: བྱམས་པ་ལ་ཡང་གནས་ལ་ཞེ་སྡང་ལ་སྤྱོད་པའི་སེམས་ཅན་དང་འགྲོགས་པ་ལ་ཡང་མི་སྨོད་པ་དང་།
en: not criticizing those who maintain love while keeping company with beings who indulge in aggression;

source: རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་ཡང་རྣམ་པར་ལྟ་ལ་གཏི་མུག་ལ་སྤྱོད་པའི་སེམས་ཅན་དང་འགྲོགས་པ་ལ་ཡང་མི་སྨོད་པའོ། །
en: and not criticizing those are aware of dependent origination while keeping company with beings who indulge in stupidity.

source: གཞན་ཡང་གསུམ་སྟེ། ལེགས་པར་སྤྱད་པའི་ཕྱིར་ཕན་པ་དང་། ཆོག་ཤེས་པའི་ཕྱིར་རན་པ་དང་། ཕྱིས་འགྱོད་པ་མེད་པའི་ཕྱིར་བཟོད་པའོ། །
en: “There are another three: being helpful because one acts well, being balanced because one is content, and being patient because one will not later feel regret.

source: གཞན་ཡང་གསུམ་སྟེ། ཐོས་པ་ཡོངས་སུ་འཛིན་པ་དང་། ཚིག་དང་ཡི་གེ་རྣམས་འཛིན་པ་དང་། སྒྲ་ལ་སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའ་ཡོངས་སུ་ཆད་པར་ཤེས་པའོ། །
en: “There are another three: retaining what one studies, retaining words and letters, and understanding the discontinuous nature of sound from the past to the future.

source: གཞན་ཡང་གསུམ་སྟེ། ནོར་བདུན་ཡང་དག་པར་འདུ་བས་དབུལ་བ་མེད་པ་དང་། ཆོས་ཀྱི་སྦྱིན་པ་རྣམ་པར་འགྲེལ་པས་གཏོང་བ་ཆེན་པོ་དང་། ཟང་ཟིང་ཀུན་ཏུ་འགེད་པས་ལོངས་སྤྱོད་ཆེ་བའོ། །
en: “There are another three: eliminating poverty through manifesting the seven riches, great giving through offering the gift of the Dharma, and increasing wealth through sharing material things.

source: གཞན་ཡང་གསུམ་སྟེ། དོན་དམ་པར་བདེན་པས་བདེན་པ་དང་། མི་སླུ་བས་ཡང་དག་པ་དང་། དེ་བཞིན་ཉིད་པས་དེ་ཁོ་ནའོ། །
en: “There are another three: being truthful in terms of the ultimate truth, being genuine through non-deception, and understanding reality through suchness.

source: གཞན་ཡང་གསུམ་སྟེ། བདག་ཅི་འདྲ་བ་ཞེས་བདག་ཤེས་པ་དང་། གཏམ་ཅི་འདྲ་བ་ཞིག་བྱ་ཞེས་སེམས་ཅན་ཤེས་པ་དང་། དུས་སུ་གནས་པས་དུས་ཤེས་པའོ། །
en: “There are another three: knowing oneself by understanding the self, knowing others in terms of what to say, and knowing time by being timely.

source: གཞན་ཡང་གསུམ་སྟེ། ཕུང་པོ་རྣམས་ལ་ཆོས་ཀྱི་ཕུང་པོ་དང་མཉམ་པ་ཉིད་དང་། ཁམས་རྣམས་ལ་ཆོས་ཀྱི་དབྱིངས་དང་མཉམ་པ་ཉིད་དང་། སྐྱེ་མཆེད་རྣམས་ལ་གྲོང་སྟོང་པ་ལྟར་སོ་སོར་རྟོག་པའོ། །
en: “There are another three: realizing the sameness of the aggregates and the Dharma collection, realizing the sameness of the elements and the realm of phenomena, and realizing the similarity of the sense sources to an empty village.

source: གཞན་ཡང་གསུམ་སྟེ། རྒྱུ་ཡིས་འབྲས་བུ་ཆུད་མི་གཟོན་པ་དང་། རྐྱེན་རྣམས་ཀྱིས་འཕེལ་བ་ལ་མཁས་པ་དང་། ཚོགས་ནས་ཕན་ཚུན་ཡང་དག་པར་འདུ་བའོ། །
en: “There are another three: knowing that causes always produce their effects, being skilled in using conditions to bring increase, and mutually reinforcing by assembling conditions.

source: གཞན་ཡང་གསུམ་སྟེ། སངས་རྒྱས་དང་མི་འགལ་བ་དང་། ཆོས་མི་སྤོང་བ་དང་། དགེ་འདུན་ལ་ང་རྒྱལ་མེད་ཅིང་བླ་མར་གུས་པར་བསྙེན་བཀུར་བྱེད་པའོ། །
en: “There are another three: not contradicting the Buddha, not abandoning the Dharma, and humbly and respectfully serving the Saṅgha.

source: གཞན་ཡང་གསུམ་སྟེ། འདོད་ཆགས་རབ་ཏུ་ཞི་བ་དང་། ཞེ་སྡང་དང་བྲལ་བ་དང་། གཏི་མུག་ཡང་དག་པར་བཅོམ་པའོ། །
en: “There are another three: pacifying attachment, eliminating aggression, and defeating stupidity.

source: གཞན་ཡང་གསུམ་སྟེ། ཀུན་རྫོབ་ཀྱི་བདེན་པ་ལ་འཇུག་པ་དང་། མཚན་ཉིད་ཀྱི་བདེན་པ་སྟོན་པ་དང་། དོན་དམ་པའི་བདེན་པ་ལ་གནས་པའོ། །
en: “There are another three: engaging with relative truth, teaching the truth of characteristics, and sustaining ultimate truth.
